#include <bits/stdc++.h>
using namespace std;

string towords(int numb);

int main() {
    int numb;
    cin >> numb;
    string str = towords(numb);
    cout << numb << " = " << str << "\n";

    return 0;
}

string towords(int numb) {
    //массив, для определения разряда, в котором находимся(сотни,десятки,еденицы...)
    int osn[] = {0, 1, 10, 100, 1000, 10000, 100000, 1000000};

    //массив оснований
    string basis[11][10] = {
            {"", "",       "",         "",         "",          "",          "",           "",          "",            ""},
            {"", "один",   "два",      "три",      "четыре",    "пять",      "шесть",      "семь",      "восемь",      "девять"},
            {"", "десять", "двадцать", "тридцать", "сорок",     "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"},
            {"", "сто",    "двести",   "триста",   "четыреста", "пятьсот",   "шестьсот",   "семьсот",   "восемьсот",   "девятьсот"},
            {"", "одна",   "две",      "три",      "четыре",    "пять",      "шесть",      "семь",      "восемь",      "девять"},
            {"", "десять", "двадцать", "тридцать", "сорок",     "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"},
            {"", "сто",    "двести",   "триста",   "четыреста", "пятьсот",   "шестьсот",   "семьсот",   "восемьсот",   "девятьсот"},
            {"", "один",   "два",      "три",      "четыре",    "пять",      "шесть",      "семь",      "восемь",      "девять"},
            {"", "десять", "двадцать", "тридцать", "сорок",     "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"},
            {"", "сто",    "двести",   "триста",   "четыреста", "пятьсот",   "шестьсот",   "семьсот",   "восемьсот",   "девятьсот"},
            {"", "один",   "два",      "три ",     "четыре",    "пять",      "шесть",      "семь",      "восемь",      "девять"}};

    //массив окончаний
    string termination[10][4] = {
            {"", "", "", "тысяч"},
            {"", "", "", "тысяча"},
            {"", "", "", "тысячи"},
            {"", "", "", "тысячи"},
            {"", "", "", "тысячи"},
            {"", "", "", "тысяч"},
            {"", "", "", "тысяч"},
            {"", "", "", "тысяч"},
            {"", "", "", "тысяч"},
            {"", "", "", "тысяч"}};

    string dec[10] = {"десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать",
                           "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    string result;

    if (!numb) {
        result = "ноль";
        return result;
    }
    int n1 = numb;
    int cnt = 0;

    //подсчет количесива цифр в числе
    while (numb) {
        numb /= 10;
        ++cnt;
    }
    int celoe;

    //перевод
    while (n1) {
        if (!((cnt + 1) % 3)) {
            if ((n1 / osn[cnt]) == 1) {
            	cout << n1 << "\n";
            	cout << osn[cnt] << "\n";
            	cout << n1 / osn[cnt] << "\n";
                n1 %= osn[cnt];
                --cnt;
                celoe = n1 / osn[cnt];
                n1 %= osn[cnt];
                result += dec[celoe];
                --cnt;
                if (!(cnt % 3))
                    result += " " + termination[0][cnt] + " ";
            }
            if (!cnt) break;
        }
        celoe = n1 / osn[cnt];
        n1 %= osn[cnt];
        result += basis[cnt][celoe] + " ";
        --cnt;
        if (!(cnt % 3))
            result += termination[celoe][cnt] + " ";
    }

    return result;
}